TexasInstruments-Sandbox/SimpleLink-Low-Power-F3-Demos/Projects/color_light_LP_EM_CC2340R5_freertos_ticlang/color_light.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --board "/ti/boards/LP_EM_CC2340R5" --device "CC2340R5RKP" --part "Default" --package "RKP" --rtos "freertos" --product "simplelink_lowpower_f3_sdk@9.14.00.39"
 * @v2CliArgs --board "/ti/boards/LP_EM_CC2340R5" --device "CC2340R5" --package "VQFN (RKP)" --variant "CC2340R52" --rtos "freertos" --product "simplelink_lowpower_f3_sdk@9.14.00.39"
 * @versions {"tool":"1.23.2+4156"}
 */

/**
 * Import the modules used in this configuration.
 */
const FreeRTOS  = scripting.addModule("/freertos/FreeRTOS");
const CCFG      = scripting.addModule("/ti/devices/CCFG");
const rfdesign  = scripting.addModule("/ti/devices/radioconfig/rfdesign");
const GPIO      = scripting.addModule("/ti/drivers/GPIO");
const GPIO1     = GPIO.addInstance();
const GPIO2     = GPIO.addInstance();
const GPIO3     = GPIO.addInstance();
const GPIO4     = GPIO.addInstance();
const LGPTimer  = scripting.addModule("/ti/drivers/LGPTimer", {}, false);
const LGPTimer1 = LGPTimer.addInstance();
const LGPTimer2 = LGPTimer.addInstance();
const Settings  = scripting.addModule("/ti/posix/freertos/Settings");
const zigbee    = scripting.addModule("/ti/zigbee/zigbee");

/**
 * Write custom configuration values to the imported modules.
 */
FreeRTOS.heapSize       = 0x00001BBC;
FreeRTOS.timerStackSize = 0x00000100;

CCFG.ccfgTemplate.$name = "ti_devices_CCFG_CCFGCC23X0Template0";

GPIO1.$hardware = system.deviceData.board.components.LED_GREEN;
GPIO1.$name     = "CONFIG_GPIO_GLED";

GPIO2.$hardware = system.deviceData.board.components.LED_RED;
GPIO2.$name     = "CONFIG_GPIO_RLED";

GPIO3.$hardware        = system.deviceData.board.components["BTN-1"];
GPIO3.$name            = "CONFIG_GPIO_BTN1";
GPIO3.pull             = "Pull Up";
GPIO3.interruptTrigger = "Falling Edge";

GPIO4.$hardware        = system.deviceData.board.components["BTN-2"];
GPIO4.$name            = "CONFIG_GPIO_BTN2";
GPIO4.pull             = "Pull Up";
GPIO4.interruptTrigger = "Falling Edge";

LGPTimer1.$name              = "CONFIG_LGPTIMER_0";
LGPTimer1.channel0Connection = "Pin";
LGPTimer1.channel1Connection = "Pin";
LGPTimer1.channel2Connection = "Pin";

LGPTimer2.$name              = "CONFIG_LGPTIMER_1";
LGPTimer2.channel2Connection = "Pin";

zigbee.zigbeeRevision  = "r22";
zigbee.deviceType      = ["zr"];
zigbee.primaryChannels = [11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26];
zigbee.txPower         = "8";

const RNG       = scripting.addModule("/ti/drivers/RNG", {}, false);
RNG.rngPoolSize = 512;
scripting.suppress("This the default noise conditioning key provided by TI, which is acceptable per NIST SP 800-90B\\. However, TI recommends you change this default value to a custom random value for your product", RNG, "noiseConditioningKeyW3");

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
GPIO1.gpioPin.$suggestSolution          = "boosterpack.40";
GPIO2.gpioPin.$suggestSolution          = "boosterpack.39";
GPIO3.gpioPin.$suggestSolution          = "boosterpack.13";
GPIO4.gpioPin.$suggestSolution          = "boosterpack.12";
LGPTimer1.timer.$suggestSolution        = "LGPT3";
LGPTimer1.timer.ch0Pin.$suggestSolution = "boosterpack.9";
LGPTimer1.timer.ch1Pin.$suggestSolution = "boosterpack.17";
LGPTimer1.timer.ch2Pin.$suggestSolution = "boosterpack.10";
LGPTimer2.timer.$suggestSolution        = "LGPT2";
LGPTimer2.timer.ch2Pin.$suggestSolution = "boosterpack.27";
